Docs/Contributing.md
```mermaid
flowchart
  roadmapCreated(["Road-map (created)"])
  roadmapApproved(["Road-map (approved)"])
  discussion(["Discussion (1 week)"])
  prDraft(["Pull request (draft)"])
  prReadyForReview(["Pull request (ready for review)"])
  prApproved(["Pull request (approved)"])
  roadmapCreated --> roadmapApproved
  discussion --> roadmapApproved & prReadyForReview --> prApproved
  roadmapCreated -.-> discussion -.-> prDraft -.-> prReadyForReview
```
