Docs/Images/Feature process.dot
digraph {
    roadmapCreated [label="Road-map (created)"]
    roadmapApproved [label="Road-map (approved)"]
    discussion [label="Discussion (1 week)"]
    prDraft [label="Pull request (draft)"] [style=dashed]
    prReadyForReview [label="Pull request (ready for review)"]
    prApproved [label="Pull request (approved)"]
    roadmapCreated -> roadmapApproved
    discussion -> {roadmapApproved,prReadyForReview} -> prApproved
    roadmapCreated -> discussion -> prDraft -> prReadyForReview [style=dashed]
}
